Revit 2027 API
ParameterTypeId.RepeatingDetailElement Property
 "Detail"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RepeatingDetailElement { get; }
Public Shared ReadOnly Property RepeatingDetailElement As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RepeatingDetailElement {
	ForgeTypeId^ get ();
}
static member RepeatingDetailElement : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace